package io.practice.loop;

import java.util.Scanner;

public class Lesson_16 {

    /**
     * Дружественные числа в диапазоне
     * Постановка задачи:
     * Пользователь вводит целое число N. Программа должна найти и вывести все пары дружественных чисел от 2 до N
     * включительно.
     * <p>
     * Два различных числа называются дружественными, если сумма собственных делителей первого числа равна второму
     * числу, а сумма собственных делителей второго — первому.
     * <p>
     * Собственные делители числа — это все его положительные делители, кроме самого числа.
     * <p>
     * Например:
     * Сумма делителей 220:
     * 1 + 2 + 4 + 5 + 10 + 11 + 20 + 22 + 44 + 55 + 110 = 284
     * <p>
     * Сумма делителей 284:
     * 1 + 2 + 4 + 71 + 142 = 220
     * <p>
     * Поэтому числа 220 и 284 являются дружественными.
     * <p>
     * Требования:
     * - N должно быть не меньше 2.
     * - Использовать вложенные циклы.
     * - Не использовать массивы и коллекции.
     * - Каждую пару выводить только один раз.
     * - Оба числа пары должны находиться в диапазоне от 2 до N.
     * - Для поиска собственных делителей не проверять числа больше половины исходного числа.
     * - Если пары не найдены, вывести соответствующее сообщение.
     */

    public static String counter(int N) {

        if (N < 2) {                                      // Если число меньше двух, то...
            return "Ошибка: число должно быть больше 2";  // Сообщение об ошибке
        }

        boolean found = false;                             //Создаем переменную, если мы нашли число, изначально = false

        for (int i = 2; i <= N; i++) {                     // Создаем цикл, проверяем все числа от 2 до N

            int sum1 = 0;                                  // Создаем переменную внутри цикла, которая будет хранить сумму делителей i

            for (int k = 1; k <= i / 2; k++) {             // Создаем цикл и перебираем делители i
                if (i % k == 0) {                          //
                    sum1= sum1 + k;
                }
            }

            if (sum1 >= 2 && sum1 <= N && sum1 != i) {

                int sum2 = 0;

                for (int j = 1; j <= sum1 / 2; j++) {
                    if (sum1 % j == 0) {
                        sum2 = sum2 + j;
                    }
                }

                if (sum2 == i && i < sum1 ) {
                    System.out.println(i + " и " + sum1);
                    found = true;
                }
            }
        }
        if (!found) {
            return "Дружественных чисел не найдено";
        }
        return "";
    }

    static void main() {
        Scanner scanner = new Scanner(System.in);
        System.out.print("Введите число N: ");
        int N = scanner.nextInt();
        String result = counter(N);
        System.out.println(result);
    }
}
