package io.practice.loop;

public class Lesson_17 {

    /**
     * Спираль из чисел
     * Постановка задачи:
     * Пользователь вводит нечётное положительное число N. Программа должна вывести квадрат размером N × N в виде
     числовой спирали.
     *
     * Числа должны начинаться с 1 в левом верхнем углу. Заполнение выполняется по часовой стрелке: вправо, вниз,
     влево и вверх.
     *
     * Требования:
     * - N должно быть нечётным числом от 3 до 9.
     * - Использовать вложенные циклы.
     * - Для хранения результата разрешается использовать только двумерный массив int[][].
     * - Не использовать коллекции.
     * - Границы незаполненной области хранить в отдельных переменных.
     * - После заполнения вывести матрицу с выравниванием столбцов.
     */
}
