package io.practice.loop;

import java.util.Scanner;

public class Lesson_14 {

    /**
     * Число Армстронга
     * Постановка задачи:
     * Пользователь вводит неотрицательное целое число N. Программа должна определить, является ли оно числом Армстронга.
     * <p>
     * Число Армстронга — это число, равное сумме своих цифр, возведённых в степень, равную количеству цифр числа.
     * <p>
     * Например:
     * 153 = 1^3 + 5^3 + 3^3
     * <p>
     * Требования:
     * - Использовать циклы.
     * - Не преобразовывать число в строку.
     * - Сначала с помощью цикла определить количество цифр.
     * - Затем с помощью другого цикла вычислить сумму степеней цифр.
     * - Не использовать Math.pow: возведение цифры в степень выполнить отдельным циклом.
     * - Число 0 считать числом Армстронга.
     */

    public static int length(int N) {

        int length = 0;

        if (N == 0) {
            length = 1;
        } else {
            N = Math.abs(N);
            for (int i = N; i > 0; i /= 10) {
                length++;
            }
        }
        return length;
    }
    public static String counter(int N) {

        if (N < 0) {                                    // Если число отрицательное, то ошибка
            return "Ошибка: число отрицательное";
        }
        if (N == 0) {                                   // Если == 0, то все равно считать числом Армстронга
            return "0 - Число Армстронга";
        }
        int originalN = N;                              // Сохраняем оригинальное число
        int n = length(N);                              // Длина строки числа
        int sum = 0;                                    // Сумма которая должна по итогу получиться

                                            // Пока число больше 0, то...
        while (N > 0) {

            int k = N % 10;                             // Создаем переменную внутри, которая хранит последнюю цифру числа
            int p = 1;                                  // Создаем переменную внутри, которая хранит степень числа

            for (int i = 1; i <= n; i++) {              // Возводим число в степень через цикл
                p = p * k;
            }
            sum = sum + p;                              // Прибавляем результат к сумме степени
            N = N / 10;                                 // Убираем последнюю цифру
        }

        if (sum == originalN) {                         // Если сумма равно оригинальной, то...
            return originalN + " - Число Армстронга ";
        }
        return originalN + " - Не число Армстронга ";   // Если нет, то...
    }


    static void main() {
        Scanner scanner = new Scanner(System.in);
        System.out.print("Введите число N: ");
        int N = scanner.nextInt();
        String result = counter(N);
        System.out.println(result);
    }
}

