package io.practice.loop;

import java.util.Scanner;

public class Lesson_15 {

    /**
     * Наибольший палиндром в диапазоне
     * Постановка задачи:
     * Пользователь вводит два положительных целых числа A и B. Программа должна найти наибольшее число-палиндром
     * в диапазоне от A до B включительно.
     * <p>
     * Число-палиндром одинаково читается слева направо и справа налево.
     * <p>
     * Требования:
     * - A должно быть меньше или равно B.
     * - Использовать циклы.
     * - Не преобразовывать числа в строки.
     * - Для каждого проверяемого числа получить обратное число с помощью операций % и /.
     * - Начать поиск с B и завершить его сразу после нахождения первого палиндрома.
     * - Если палиндромов нет, вывести соответствующее сообщение.
     */

    public static String counter(int A, int B) {

        if (A < 0 || B < 0) {                                      // Если одно из чисел отрицательное, то...
            return "Ошибка: число отрицательное";                  // Возвращаем сообщение об ошибке
        }
        if (A > B) {                                               // Если А больше В, то...
            return "Ошибка: A должно быть меньше или равно B";     // Возвращаем сообщение об ошибке
        }

        boolean found = false;                                     // Создаем переменную, если мы нашли число, изначально = false
        int result = 0;                                            // Создаем переменную с конечным результатом, изначально = 0

        for (int i = B; i >= A; i--) {                             // Создаем цикл, который идет с В до А

            int polindrome = 0;                                    // Создаем переменную для перевернутого числа
            int number = i;                                        // Создаем копию числа, которую будем делить

            while (number > 0) {                                   // Пока деление больше 0, то...
                int d = number % 10;                               // Создаем переменную где будет последняя цифра числа
                polindrome = polindrome * 10 + d;                  // Делаем перевернутое число
                number = number / 10;                              // Убираем последнюю цифру из числа
            }
            if (i == polindrome) {                                 // Если оригинальное число == перевернутому, то...
                found = true;                                      // Найденное число = true
                result = i;                                        // Перезаписываем результат
                break;                                             // Выходим из цикла
            }
        }
        if (found) {                                               // Если мы нашли число, то...
            return "Наибольший палиндром: " + result;              // Возвращаем результат
        }
        return "Палиндромов нет";                                   // Иначе возвращаем сообщение, что палиндрома нет
    }

    static void main() {
        Scanner scanner = new Scanner(System.in);
        System.out.print("Введите число A: ");
        int p = scanner.nextInt();
        System.out.print("Введите число B: ");
        int k = scanner.nextInt();
        String result = counter(p, k);
        System.out.println(result);
    }
}
